import Image from "next/image";

export default function SuljmelSection() {
  return (
    <div className="mt-3 leading-relaxed text-left max-w-4xl mx-auto">
      <h1 className="font-bold text-blue-900 text-2xl">
        СҮЛЖМЭЛИЙН ҮЙЛДВЭРИЙН ТЕХНОЛОГИ МЭРГЭЖЛИЙН СУРАЛЦАГЧИД ШУТИС-ИЙН ХӨНГӨН
        ҮЙЛДВЭРИЙН СУДАЛГАА ХӨГЖЛИЙН ХҮРЭЭЛЭНГИЙН ЛАБОРАТОРТАЙ ТАНИЛЦЛАА.
      </h1>
      <p>
        СҮЛЖМЭЛИЙН ҮЙЛДВЭРИЙН ТЕХНОЛОГИ МЭРГЭЖЛИЙН СУРАЛЦАГЧИД ШУТИС-ИЙН ХӨНГӨН
        ҮЙЛДВЭРИЙН СУДАЛГАА ХӨГЖЛИЙН ХҮРЭЭЛЭНГИЙН ЛАБОРАТОРТАЙ ТАНИЛЦЛАА.
        Монгол-Солонгосын Политехник коллежийн Сүлжмэлийн үйлдвэрийн технологи
        мэргэжлийн ангийн суралцагчид ШУТИС-н Үйлдвэрлэлийн Технологийн
        сургуулийн харьяа Хөнгөн үйлдвэрийн судалгаа хөгжлийн хүрээлэнгийн
        Текстилийн инженерчлэлийн хөтөлбөрийн агуулга, сургалтын орчин, ноос
        ноолууран ширхэгийг таних лаборатори, ноос ноолуур боловсруулах тоног
        төхөөрөмжтөй танилцав. Бид ажил олгогч түншлэгч байгууллагуудтайгаа
        хамтран мэргэжлийн боловсрол, сургалтын чанар, төгсөгчдийн хөдөлмөр
        эрхлэлтийг нэмэгдүүлэх, нийгмийн үнэлэмжийг дээшлүүлэх, түншлэл хамтын
        ажиллагааг бэхжүүлэх чиглэлээр олон ажлыг хийж хэрэгжүүлж байгаа билээ.
        Энэ хүрээнд хөнгөн үйлдвэрийн салбар, мэргэжлийн онцлог, шаталсан
        сургалтын давуу тал болон хөтөлбөрийн агуулгын судалгаа хийлээ.
      </p>
      <Image
        src="/../suljmel.jpg"
        alt="Сүлжмэлийн лабораторийн зураг"
        width={750}
        height={500}
        className="rounded-xl shadow-md my-4"
      />
    </div>
  );
}
