import React from "react";

const FashionProgramDetailPage = () => {
  return (
    <div className="max-w-4xl mx-auto px-6 py-10">
      <h1 className="text-3xl font-bold text-blue-900 mb-4">
        Хувцасны загвар зохион бүтээгч
      </h1>
      <p className="text-gray-700 leading-relaxed mb-4"></p>
      Хувцасны анхдагч элемэнтүүд зохиомжийн аргууд , хувцасны эскиз зурах арга
      техник арга барил эзэмших мөн төрөл бүрийн оёмол бүтээгдэхүүнийг хүний
      биеийн галбирт тохируулан загварын дагуу эсгүүр гаргаж загварчлах ,
      тэдгээрийг судлах дүн шинжилгээ хийж харьцуулах , орчин үеийн тоног
      төхөөрөмж болон Компьютерын програм ашиглан , эсгүүр гарган бүтээгдэхүүн
      оёх ажил гүйцэтгэнэ.
      <p className="text-gray-700 leading-relaxed py-4">
        "Хувцасны загвар зохион бүтээгч" мэргэжлээр бүрэн дунд боловсрол бүхий
        элсэгчид дипломын дунд боловсролыг эзэмшихэд 3 жил , мэргэжлтийн
        боловсролын "Хувцасны дизайн", "Оёмол бүтээгдэхүүний оёдолчин"-ны
        мэргэжлийн үнэмлэхтэй элсэгчид дипломын дунд боловсролыг эзэмшихэд 1,5
        жил суралцана.
      </p>
      <p className="text-blue-700 font-semibold mb-6">
        Суралцах хугацаа: 3 жил.
      </p>
      <h3 className="text-2xl font-bold text-blue-900 mb-4">
        Сургалтын давуу талууд
      </h3>
      <p className="mb-4">
        Хувцасны эскиз зурах , хувцасны зохион бүтээлт хийх , бүтээгдэхүүнийг
        загварчлах , эсгэх , оёх , гүйцэтгэх ажлаар хувцасны салон , оёдлын
        үйлдвэр аж ахуй нэгжид ажиллах бүрэн боломжтой бөгөөд тухайн
        мэргэжлээрээ их дээд сургуульд шатлан суралцах боломжтой
      </p>
      <img src="../oydol1.jpg" alt="оёдолийн анги" />
    </div>
  );
};

export default FashionProgramDetailPage;
