import React from "react";

const ITProgramDetailPage = () => {
  return (
    <div className="max-w-4xl mx-auto px-6 py-10">
      <h1 className="text-3xl font-bold text-blue-900 mb-4">
        Мэдээллийн технологи
      </h1>
      <p className="text-gray-700 leading-relaxed mb-6">
        Мэдээллийн технологич мэргэжлээр мэдээллийн технологийн хэрэгцээ болон
        дэд бүтцэд тохируулан тоног төхөөрөмж, програм хангамжийг сонгох,
        суурилуулах, сүлжээний тохиргоо хийх, сүлжээний удирдлага, мэдээллийн
        систем болон системийн аюулгүй байдлыг хангах, вэб болон мобайл программ
        хөгжүүлэлт хийх, байгууллагын технологийн үйлчилгээг хангах, технологийн
        удирдлага ба төлөвлөлт хийх зэрэг ур чадварыг эзэмшинэ.
        <br />
        Төгсөгч нь боловсрол, нийгэм, эдийн засгийн бүхий л салбарт ажиллах
        боломжтой бөгөөд байгууллагын мэдээллийн технологийн асуудлыг төлөвлөж,
        шийдвэр гаргаж, хэрэгжүүлэх ажлын хэсэгт оролцох чадамжтай байна.
      </p>

      <h3 className="text-blue-700 font-bold py-2">
        Мэргэжлийн хөтөлбөрийн агуулга:
      </h3>
      <ul className="list-disc list-inside text-gray-700 space-y-1 mb-6">
        <li>Програмчлал болон хөгжүүлэлт</li>
        <li>Мобайл програмчлал ба технологи</li>
        <li>Вэб зохиомж, вэб систем ба технологи</li>
        <li>Мэдээллийн систем, систем ба сүлжээний удирдлага</li>
        <li>Мультимедиа болон вектор график дизайн</li>
      </ul>

      <p className="text-blue-700 font-semibold mb-6">
        Суралцах хугацаа: 3 жил.
      </p>

      <h2 className="text-2xl font-bold text-blue-900 mb-4">
        Сургалтын давуу талууд
      </h2>
      <ul className="list-disc list-inside text-gray-700 space-y-2 mb-10">
        <li>Чадамжинд суурилсан сургалтын хөтөлбөр</li>
        <li>Орчин үеийн сургалтын гарын авлага, сурах бичиг</li>
        <li>Чадварлаг багш</li>
        <li>Тоног төхөөрөмж бүхий дадлагын орчин</li>
        <li>Мэргэжлийн диплом олгоно</li>
        <li>Их, дээд сургуульд шатлан суралцах боломжтой</li>
      </ul>

      <div className="w-full h-auto">
        <img
          src="../technology.jpg"
          alt="Мэдээллийн технологи сурагч"
          className="rounded-lg shadow-md"
        />
      </div>
    </div>
  );
};

export default ITProgramDetailPage;
